<a href="https://colab.research.google.com/github/kim-star/DataScience/blob/master/210813_%EB%B6%80%EC%82%B0%EB%8C%80%ED%95%99%EA%B5%90_Pandas%EC%8B%A4%EC%8A%B5_%EB%B0%B0%ED%8F%AC%EC%9A%A9%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas 시작하기

In [ ]:
import pandas as pd

In [ ]:
pd.__version__

'1.1.5'

## 자료구조 Series

### Series 의 생성(1)

In [ ]:
# 리스트 데이터로 Series 객체 생성하기
#  _____ 란에 실습을 시작하세요.

year = ['2019', '2020', '2021', '2022']
result = pd.Series(data=year)

print('Type:', type(result))
print(result)

Type: <class 'pandas.core.series.Series'>
0    2019
1    2020
2    2021
3    2022
dtype: object

In [ ]:
# Series 객체의 주요 속성
print('Index: ', result.index)
print('Data: ', result.values)
print('DType: ', result.dtype)
print('Shape: ', result.shape)

Index:  RangeIndex(start=0, stop=4, step=1)
Data:  ['2019' '2020' '2021' '2022']
DType:  object
Shape:  (4,)

In [ ]:
# Series 객체의 이름 지정
result.name = 'Year'
result.index.name = 'No.'
print(result)

No.
0    2019
1    2020
2    2021
3    2022
Name: Year, dtype: object

### Series 의 생성(2)

In [ ]:
# 인덱스 추가하여 Series 객체 생성하기
year = ['2019', '2020', '2021', '2022']
idx = ['a', 'b', 'c', 'd']
result = pd.Series(data=year, index=idx, name='Year')
print(result)

a    2019
b    2020
c    2021
d    2022
Name: Year, dtype: object

### Series 의 생성(3)

In [ ]:
# 딕셔너리 데이터로 Series 객체 생성하기
score = {'Kim':85, 'Han':89, 'Lee':99, 'Choi':70}

result = pd.Series(data=score, name='Score')
print(result)

Kim     85
Han     89
Lee     99
Choi    70
Name: Score, dtype: int64

## 자료구조 DataFrame

### DataFrame 의 생성(1)

In [ ]:
# 파이썬 딕셔너리 객체 이용하여 DataFrame 생성하기
score = {'name': ['Jessi', 'Emma', 'Alex', 'Tom'],
         'score': [100, 95, 80, 85],
         'grade': ['A', 'A', 'B', 'B']}
        
df = pd.DataFrame(data=score)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

    name  score grade
0  Jessi    100     A
1   Emma     95     A
2   Alex     80     B
3    Tom     85     B

In [ ]:
# DataFrame 주요 속성 실습-1
print('-Index: ', df.index)
print('-Columns: ', df.columns)
print('-Values:', df.values)

-Index:  RangeIndex(start=0, stop=4, step=1)
-Columns:  Index(['name', 'score', 'grade'], dtype='object')
-Values: [['Jessi' 100 'A']
 ['Emma' 95 'A']
 ['Alex' 80 'B']
 ['Tom' 85 'B']]

In [ ]:
# DataFrame 주요 속성 실습-2
print('-DTypes: ', df.dtypes)
print('-Shape: ', df.shape)

-DTypes:  name     object
score     int64
grade    object
dtype: object
-Shape:  (4, 3)

### DataFrame 의 생성(2)

In [ ]:
# index, columns 지정하여 DataFrame 생성하기
score = {'name': ['Jessi', 'Emma', 'Alex', 'Tom'],
         'score': [100, 95, 80, 85],
         'grade': ['A', 'A', 'B', 'B']}     
i = ['a', 'b', 'c', 'd']
c = ['score', 'grade', 'name', 'email']
        
df = pd.DataFrame(data=score, index=i, columns=c)
df

   score grade   name email
a    100     A  Jessi   NaN
b     95     A   Emma   NaN
c     80     B   Alex   NaN
d     85     B    Tom   NaN

## DataFrame 살펴보기

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
score_df

    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

* info(), head(), tail(), sample() 실습

In [ ]:
score_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   score    5 non-null      int64
 2   grade    5 non-null      object
 3   subject  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [ ]:
score_df.head()

    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

In [ ]:
score_df.tail(3)

    name  score grade subject
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

In [ ]:
score_df.sample(frac=0.5)

   name  score grade subject
2  Alex     80     B  python
4   Tom     97     A    java

## 수치형과 범주형 데이터의 이해

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'age': [20, 24, 23, 20, 27],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
score_df

    name  age  score grade subject
0  Jessi   20    100     A  python
1   Emma   24     95     A    java
2   Alex   23     80     B  python
3  Jessi   20     85     B       c
4    Tom   27     97     A    java

In [ ]:
# describe() 함수 실습
print("Generate Descriptive Statistics")
score_df.describe()

Generate Descriptive Statistics

             age       score
count   5.000000    5.000000
mean   22.800000   91.400000
std     2.949576    8.502941
min    20.000000   80.000000
25%    20.000000   85.000000
50%    23.000000   95.000000
75%    24.000000   97.000000
max    27.000000  100.000000

In [ ]:
# 범주형 데이터에 대한 describe() 함수 실습
print("Generate Descriptive Statistics for Categorical")
print(score_df[['grade', 'subject']].describe())

Generate Descriptive Statistics for Categorical
       grade subject
count      5       5
unique     2       3
top        A    java
freq       3       2

In [ ]:
# 범주형 데이터를 위한 unique() 함수 실습
print("The Unique Values")
print(score_df['subject'].unique())

The Unique Values
['python' 'java' 'c']

In [ ]:
# 범주형 데이터를 위한 value_counts() 함수 실습
print("The Value Counts")
print(score_df['subject'].value_counts(normalize=True))

The Value Counts
java      0.4
python    0.4
c         0.2
Name: subject, dtype: float64

## 데이터 조회 및 변경

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
df

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# 인덱싱 기법으로 열 데이터 조회 실습
print('Columns : name')
df['name']

Columns : name

0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [ ]:
# . 연산자로 열 데이터 조회 실습
print('Columns : name')
df.name

Columns : name

0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [ ]:
# df.name 의 타입 출력하여 확인
print('Type:', type(df.name))

Type: <class 'pandas.core.series.Series'>

In [ ]:
# 다중 열 데이터 조회 실습
print('Columns : name-subject-grade')
print(df[['name', 'subject', 'grade']])

Columns : name-subject-grade
    name subject grade
0  Jessi  python     A
1   Emma    java     A
2   Alex  python     B
3  Jessi       c     B
4    Tom    java     A

In [ ]:
# etc 열 데이터 변경하기
print('Modify Column Data')
df['etc'] = 0
df

Modify Column Data

    name subject  score grade  etc
0  Jessi  python    100     A    0
1   Emma    java     95     A    0
2   Alex  python     80     B    0
3  Jessi       c     85     B    0
4    Tom    java     97     A    0

In [ ]:
# loc 이용하여 행 데이터 조회 실습
print('Rows-1')
print(df.loc[1])

Rows-1
name       Emma
subject    java
score        95
grade         A
etc           0
Name: 1, dtype: object

In [ ]:
# loc 이용하여 다중 행 데이터 조회 실습
print('Rows-0,2,4')
df.loc[[0,2,4]]

Rows-0,2,4

    name subject  score grade  etc
0  Jessi  python    100     A    0
2   Alex  python     80     B    0
4    Tom    java     97     A    0

In [ ]:
# 특정 행 데이터 변경 실습
print('Modify Rows0')
df.loc[0] = ['Jessi', 'java', 70, 'C', 1]
df

Modify Rows0

    name subject  score grade  etc
0  Jessi    java     70     C    1
1   Emma    java     95     A    0
2   Alex  python     80     B    0
3  Jessi       c     85     B    0
4    Tom    java     97     A    0

In [ ]:
# 행과 열의 조건을 동시에 지정하여 조회 실습
row_idx = [1,2,4]
col_idx = ['name', 'subject', 'grade']

print('Rows & Columns')
print(df.loc[row_idx, col_idx])

Rows & Columns
   name subject grade
1  Emma    java     A
2  Alex  python     B
4   Tom    java     A

## 데이터 추가, 삭제

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
print(df)

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# Series 객체 생성하여 'semester' 라는 열 추가
semester_data = pd.Series(['20-01', '20-01', '20-02', '20-01'])
df['semester'] = semester_data

print('Add Columns : semester')
df

Add Columns : semester

    name subject  score grade  etc semester
0  Jessi    java     70     C    1    20-01
1   Emma    java     95     A    0    20-01
2   Alex  python     80     B    0    20-02
3  Jessi       c     85     B    0    20-01
4    Tom    java     97     A    0      NaN

In [ ]:
# 연산 이용하여 'high_score' 라는 열 추가
df['high_score'] = df['score'] > 90

print('Add Columns : high_score')
df

In [ ]:
# 6 번 인덱스에 행 데이터 추가
df.loc[6] = ['Jina', 'python', 100, 'A', 1]

print('Add Row 6')
df

Add Row 6

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN
6   Jina  python    100     A    1

In [ ]:
# 1) drop() 이용하여 행 데이터 삭제
# 2) inplace 인자를 사용하여 원본 데이터에 바로 삭제
df.drop(6, inplace=True)

print('Delete Row : 6')
df

In [ ]:
# drop() 이용하여 'etc' 열 삭제 (원본데이터변경)
df.drop(columns=['etc'], inplace=True)

print('Delete Column :')
df

## 데이터 파일 읽기

In [ ]:
filepath = '/content/titanic.csv'

titanic_df = pd.read_csv(filepath)
type(titanic_df)

pandas.core.frame.DataFrame

In [ ]:
# info() 확인해보기
print('Summary of DataFrame')
titanic_df.info()

Summary of DataFrame
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# sample 데이터 출력해보기
print('Return the first n rows')
titanic_df.head()

Return the first n rows

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
# 엑셀 파일에서 데이터 읽기
filepath2 = '/content/students_score.xlsx'

print('Read students_score.xlsx')
sample_df = pd.read_excel(filepath2)
sample_df

Read students_score.xlsx

   Jessi  20  100  A  python
0   Emma  24   95  A    java
1   Alex  23   80  B  python
2  Jessi  20   85  B       c
3    Tom  27   97  A    java
4    Sia  28   79  C  python

In [ ]:
# 1) header=none 옵션으로 컬럼 없이 데이터 읽기
# 2) df.columns 에 새로운 컬럼명 저장하기
sample_df = pd.read_excel(filepath2, header=2)
sample_df.columns = ['name', 'age', 'score', 'grade', 'subject']

print('Read Excel by header=none')
sample_df

Read Excel by header=none

    name  age  score grade subject
0  Jessi   20     85     B       c
1    Tom   27     97     A    java
2    Sia   28     79     C  python

In [ ]:
# 'students' sheet 에 있는 데이터 읽기
print('Read Excel on students sheet')
student_df = pd.read_excel(filepath2, sheet_name='students')
student_df

Read Excel on students sheet

    name  age  etc1  etc2  etc3                email
0    Lee   25   0.1   0.1   0.1    lee@codepresso.kr
1  Hwang   24   0.1   0.1   0.1  hwang@codepresso.kr
2    Kim   28   0.1   0.1   0.1    kim@codepresso.kr
3   Choi   27   0.1   0.1   0.1   choi@codepresso.kr
4   Park   21   0.1   0.1   0.1   park@codepresso.kr
5    Lim   20   0.1   0.1   0.1    lim@codepresso.kr

## 데이터 전처리(1)

* 샘플데이터 생성

In [13]:
import pandas as pd
import numpy as np

# 실습 데이터 생성
df = pd.DataFrame(data = np.arange(18).reshape(6,3),
				  index = ['a','b','c','d','e','f'],
                  columns=['col1','col2','col3'])
                  
df['col4'] = pd.Series(data = [1.7, 1.2, 2.4], 
                       index = ['a','e','c'])
df.loc['c'] = None

# 실습 데이터 출력
print(df)

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
c   NaN   NaN   NaN   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

In [ ]:
# df.info() 함수로 결측치 유무 확인하기
print('#1 Summary of DataFrame')
df.info()

#1 Summary of DataFrame
<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    5 non-null      float64
 2   col3    5 non-null      float64
 3   col4    2 non-null      float64
dtypes: float64(4)
memory usage: 400.0+ bytes

In [ ]:
# df.isnull() 함수로 결측치 유무 확인하기
print('#2 isnull of DataFrame')
print(df.isnull())

#2 isnull of DataFrame
    col1   col2   col3   col4
a  False  False  False  False
b  False  False  False   True
c   True   True   True   True
d  False  False  False   True
e  False  False  False  False
f  False  False  False   True

In [ ]:
print('#4 Sum of all missing values per columns')
df.isnull().sum()

#4 Sum of all missing values per columns

col1    1
col2    1
col3    1
col4    4
dtype: int64

In [ ]:
print('#5 Sum of all missing values per rows')
df.isnull().sum(axis=1)

#5 Sum of all missing values per rows

a    0
b    1
c    4
d    1
e    0
f    1
dtype: int64

## 데이터 전처리(2)

In [4]:
df.isnull().sum()

col1    1
col2    1
col3    1
col4    4
dtype: int64

In [8]:
# 행을 기준으로 결측치 조회하여 제거하기
print('#1 Remove missing values')
df.dropna(how='all')
#print(df)

#1 Remove missing values

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

In [14]:
# 원본데이터에 반영
print('#2 Remove missing values with inpalce=True')
df.dropna(how='all', inplace=True)
df

#2 Remove missing values with inpalce=True

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

In [15]:
# 열을 기준으로 결측치 조회하여 제거하기
print('#3 Remove missing values in columns')
df.dropna(axis='columns', how='all')

#3 Remove missing values in columns

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

In [16]:
# 실습 데이터 추가
df.iloc[:2, 0] = np.nan
df.iloc[:4, 1] = np.nan
print(df)

   col1  col2  col3  col4
a   NaN   NaN   2.0   1.7
b   NaN   NaN   5.0   NaN
d   9.0   NaN  11.0   NaN
e  12.0   NaN  14.0   1.2
f  15.0  16.0  17.0   NaN

In [17]:
# 결측값을 0 으로 대체하기
print('#4 Replace missing values')
df.fillna(0)

#4 Replace missing values

   col1  col2  col3  col4
a   0.0   0.0   2.0   1.7
b   0.0   0.0   5.0   0.0
d   9.0   0.0  11.0   0.0
e  12.0   0.0  14.0   1.2
f  15.0  16.0  17.0   0.0

In [ ]:
# 딕셔너리를 활용한 컬럼별 대체값 지정하기
print('#5 Replace missing values')
replace_set = {'col2':0, 'col4':'100'}

In [19]:
print('#6 Replace missing values')
replace_set = {'col1':df['col1'].mean()}
df.fillna(replace_set, inplace=True)
df

#6 Replace missing values

   col1  col2  col3  col4
a  12.0   NaN   2.0   1.7
b  12.0   NaN   5.0   NaN
d   9.0   NaN  11.0   NaN
e  12.0   NaN  14.0   1.2
f  15.0  16.0  17.0   NaN

## 데이터 인덱싱

In [20]:
# 실습 데이터 생성
d = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
     'score': [100, 95, 80, 85, 97],
     'grade': ['A', 'A', 'B', 'B', 'A'],
     'subject':['python', 'java', 'python', 'c', 'java']}

df = pd.DataFrame(data=d)

# 실습 데이터 출력
print(df)

    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

In [21]:
# name 컬럼을 행 인덱스로 바꾸기
print('#1 Set Index')
df.set_index('name', inplace=True)
df

#1 Set Index

       score grade subject
name
Jessi    100     A  python
Emma      95     A    java
Alex      80     B  python
Jessi     85     B       c
Tom       97     A    java

In [22]:
# loc[] 를 통해 행 데이터 조회하기
print('#2 Access rows')
subset = df.loc[['Jessi', 'Emma']]
subset

#2 Access rows

       score grade subject
name
Jessi    100     A  python
Jessi     85     B       c
Emma      95     A    java

In [ ]:
# iloc[] 를 통해 행 데이터 조회하기
print('#3 Access rows by index position')
subset = ________________________
subset

In [ ]:
# loc[] 의 활용 : Boolean Indexing
print('#4 Access rows by boolean indexing')
subset = ________________________
subset

In [ ]:
# loc[] 의 활용 : Boolean Indexing
print('#5 Access rows by boolean indexing')
subset = ________________________
subset

## 데이터 슬라이싱

In [23]:
# 실습 데이터 생성
d = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
     'score': [100, 95, 80, 85, 97],
     'grade': ['A', 'A', 'B', 'B', 'A'],
     'subject':['python', 'java', 'python', 'c', 'java']}

sample_df = pd.DataFrame(data=d)
sample_df.set_index('name', inplace=True)

# 실습 데이터 출력
print(sample_df)

       score grade subject
name
Jessi    100     A  python
Emma      95     A    java
Alex      80     B  python
Jessi     85     B       c
Tom       97     A    java

In [26]:
print('#1 Access Rows by slicing')
subset = sample_df[1:4]
subset

#1 Access Rows by slicing

       score grade subject
name
Emma      95     A    java
Alex      80     B  python
Jessi     85     B       c

In [27]:
print('#2 Access Rows by slicing')
subset = sample_df[::2]
subset

#2 Access Rows by slicing

       score grade subject
name
Jessi    100     A  python
Alex      80     B  python
Tom       97     A    java

In [28]:
print('#3 Access Rows by slicing')
subset =sample_df[:'Alex']
subset

#3 Access Rows by slicing

       score grade subject
name
Jessi    100     A  python
Emma      95     A    java
Alex      80     B  python

In [31]:
print('#4 Access Rows by loc[slicing]')
subset = sample_df.loc[:'Emma',['subject', 'grade']]
subset

#4 Access Rows by loc[slicing]

      subject grade
name
Jessi  python     A
Emma     java     A

In [32]:
print('#5 Access Rows by iloc[slicing]')
subset = sample_df.iloc[:4,-1]
subset

#5 Access Rows by iloc[slicing]

name
Jessi    python
Emma       java
Alex     python
Jessi         c
Name: subject, dtype: object

## Pandas 의 집계함수

In [33]:
# 실습 데이터 생성
score = {'sub1': [3, 9, 1, 1, 9],
         'sub2': [2, 9, np.nan, np.nan, 8],
         'sub3': [np.nan, 1, 5, 5, 7],
         'sub4': [np.nan, 3, np.nan, 1, np.nan]}

df = pd.DataFrame(data=score)

# 실습 데이터 출력
print(df)

   sub1  sub2  sub3  sub4
0     3   2.0   NaN   NaN
1     9   9.0   1.0   3.0
2     1   NaN   5.0   NaN
3     1   NaN   5.0   1.0
4     9   8.0   7.0   NaN

In [34]:
print('#1 Count Function')
df.count()

#1 Count Function

sub1    5
sub2    3
sub3    4
sub4    2
dtype: int64

In [35]:
print('#2 Count Function with axis=1')
df.count(axis=1)

#2 Count Function with axis=1

0    2
1    4
2    2
3    3
4    3
dtype: int64

In [36]:
print('#3 Sum Function')
print(df.sum())

#3 Sum Function
sub1    23.0
sub2    19.0
sub3    18.0
sub4     4.0
dtype: float64

In [40]:
print('#4 Sum Function with skipna')
print(df.sum(skipna=False))

#4 Sum Function with skipna
sub1    23.0
sub2     NaN
sub3     NaN
sub4     NaN
dtype: float64

## 데이터 그룹화

In [50]:
# 실습 데이터 생성
sample = {'product':['a','b','a','b','a','b','a','a'],
          'sensor':['s1','s1','s2','s3','s2','s2','s1','s3'],
          'x':np.arange(1,9),
          'y':np.arange(5,13)}

df = pd.DataFrame(data=sample)

# 실습 데이터 출력
print(df)

  product sensor  x   y
0       a     s1  1   5
1       b     s1  2   6
2       a     s2  3   7
3       b     s3  4   8
4       a     s2  5   9
5       b     s2  6  10
6       a     s1  7  11
7       a     s3  8  12

In [51]:
# product 컬럼 기준으로 그룹화하기
print('#1 groupby-product')
grouped_product = df.groupby('product')
grouped_product

#1 groupby-product

In [52]:
# grouped_product 에 저장된 key와 value 출력하기
print('#2 key & value')
for key, value in grouped_product:
      print("-----------------------")
      print("key :", key)
      print("value :\n", value)

#2 key & value
-----------------------
key : a
value :
   product sensor  x   y
0       a     s1  1   5
2       a     s2  3   7
4       a     s2  5   9
6       a     s1  7  11
7       a     s3  8  12
-----------------------
key : b
value :
   product sensor  x   y
1       b     s1  2   6
3       b     s3  4   8
5       b     s2  6  10

In [96]:
# groupby 결과에 집계함수 적용하기
print('#3 groupby-product')
grouped_product = df.groupby("product").sum().sum(axis=1)
grouped_product

#3 groupby-product

product
a    68
b    36
dtype: int64

In [58]:
# product, sensor 기준으로 그룹화하기
# 그룹화한 뒤 x 컬럼에 대해서만 집계함수 적용하기
print('#4 groupby-product,sensor')
grouped_product = df.groupby(['product', 'sensor'])['x'].sum()
grouped_product

#4 groupby-product,sensor

product  sensor
a        s1        8
         s2        8
         s3        8
b        s1        2
         s2        6
         s3        4
Name: x, dtype: int64

In [59]:
# 그룹화한 뒤 x 컬럼에 대해서만 집계함수 적용하기
print('#6 groupby-product,sensor')
condition = {'x':'max', 'y':'min'}
grouped_product =  df.groupby(['product','sensor']).agg(condition)
grouped_product

#6 groupby-product,sensor

                x   y
product sensor
a       s1      7   5
        s2      5   7
        s3      8  12
b       s1      2   6
        s2      6  10
        s3      4   8

## 데이터 합치기(1)

* 실습 데이터 생성

In [60]:
import pandas as pd

# 실습 데이터 생성
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])                   

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                    index=[2, 3, 6, 7])
                    
print('DF1')
print(df1)
print('\nDF2')
print(df2)
print('\nDF3')
print(df3)
print('\nDF4')
print(df4)

DF1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

DF2
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

DF3
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

DF4
    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [62]:
# df2, df1 합치기
print('#1 Concat df2, df1')
result = pd.concat([df1, df2])
result

#1 Concat df2, df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [73]:
# shape 이 서로 다른 df1, df4 합치기
print('#2 Concat df1, df4')
result = pd.concat([df1, df4])
result

#2 Concat df1, df4

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [74]:
# 슬라이싱을 통해 일부 데이터 합치기
print('#3 Concat df1, df4 by slicing')
result = pd.concat([df1[:2], df4[3:]])
result

#3 Concat df1, df4 by slicing

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
7  NaN  B7  NaN  D7   F7

In [81]:
# 행 기준으로 df1, df4 합치기
print('#4 Concat df1, df4 by axis=1')
result = pd.concat([df1, df4],axis=1, ignore_index=True)
result

#4 Concat df1, df4 by axis=1

     0    1    2    3    4    5    6
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [82]:
# 교집합으로 데이터 결합하기
print('#5 Concat df1, df4 by join=inner')
#result = pd.concat([df1, df4], join='inner')
result = pd.concat([df1, df4], join='inner', axis=1)
result

#5 Concat df1, df4 by join=inner

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

## 데이터 합치기(2)

In [84]:
# 실습 데이터 생성
stu1 = pd.DataFrame({'name':['Kim','Lee','Choi'],
                     'subject':['c', 'python', 'c'],
                     'result':['pass','pass', 'fail']})

stu2 = pd.DataFrame({'name':['Kim','Hwang','Lee','Park'],
                    'language':['c','java','python','python'],
                    'score':[95,85,97,80]})

In [85]:
# 실습 데이터 출력
print('stu1')
print(stu1)

stu1
   name subject result
0   Kim       c   pass
1   Lee  python   pass
2  Choi       c   fail

In [86]:
# 실습 데이터 출력
print('stu2')
print(stu2)

stu2
    name language  score
0    Kim        c     95
1  Hwang     java     85
2    Lee   python     97
3   Park   python     80

In [89]:
#stu1, stu1 합치기
print('#1 Merge stu1, stu2')
#result = pd.merge(stu1, stu2)
result = pd.merge(stu1, stu2, on='name')
result

#1 Merge stu1, stu2

  name subject result language  score
0  Kim       c   pass        c     95
1  Lee  python   pass   python     97

In [94]:
#key 값을 기준으로 stu1, stu1 합치기
print('#2 Merge stu1, stu2 by key value')
result = pd.merge(stu1, stu2,
                  left_on=['subject'],
                  right_on=['language']
                  )
result

#2 Merge stu1, stu2 by key value

  name_x subject result name_y language  score
0    Kim       c   pass    Kim        c     95
1   Choi       c   fail    Kim        c     95
2    Lee  python   pass    Lee   python     97
3    Lee  python   pass   Park   python     80

In [91]:
#합집합으로 데이터 합치기
print('#3 Merge stu1, stu2 by how=outer')
result = pd.merge(stu1, stu2, on='name', how='outer')
result

#3 Merge stu1, stu2 by how=outer

    name subject result language  score
0    Kim       c   pass        c   95.0
1    Lee  python   pass   python   97.0
2   Choi       c   fail      NaN    NaN
3  Hwang     NaN    NaN     java   85.0
4   Park     NaN    NaN   python   80.0

In [92]:
#stu2 기준으로 데이터 합치기
print('#4 Merge stu1, stu2 by how=right')
result = pd.merge(stu1, stu2, on='name', how='right')
result

#4 Merge stu1, stu2 by how=right

    name subject result language  score
0    Kim       c   pass        c     95
1  Hwang     NaN    NaN     java     85
2    Lee  python   pass   python     97
3   Park     NaN    NaN   python     80